Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Escape characters can be contain in the "format control" such as \n (@LF), \r (@CR), \t (@TAB].
fr: Les caractères d'échappement peuvent être utilisés dans la chaîne "format control" comme \n (@LF), \r (@CR ), \t (@TAB).

source: So if you want to have a "\" you need to use \\, samething for "%" %%.
fr: Donc, si vous voulez avoir un "\" vous devez utiliser \\, même chose pour "%".

source: "variable format" is; %[flags] [width] [.precision] type
fr: La "variable format" est %[flags] [width] [.precision] type

source: If a format specification is invalid, the behaviour is undefined.
fr: Si une spécification de format est invalide, le comportement est indéfini.

source: If you specify invalid input you can in special circumstances create unhandled exception and cause program termination.
fr: Si vous spécifiez une entrée non valide, vous pouvez créer des circonstances spéciales non gérée et provoquer la fin du programme.

source: Width Specification
fr: Spécification Width

source: The second optional field of the format specification is the width specification.
fr: Le deuxième champ optionnel de la spécification du format est la largeur.

source: The width argument is a nonnegative decimal integer controlling the minimum number of characters printed.
fr: L'argument 'width' est un entier décimal non négatif contrôlant le nombre minimum de caractères affichés.

source: If the number of characters in the output value is less than the specified width, blanks are added to the left or the right of the values — depending on whether the – flag (for left alignment) is specified — until the minimum width is reached.
fr: Si le nombre de caractères à afficher est inférieur à la largeur spécifiée, des espaces sont ajoutés à gauche ou à droite selon que le drapeau (pour un alignement à gauche) est spécifiée, jusqu'à ce que la largeur minimale soit atteinte.

source: If width is prefixed with 0, zeros are added until the minimum width is reached (not useful for left-aligned numbers).
fr: Si la largeur est précédé de 0, des zéros sont ajoutés jusqu'à ce que la largeur minimale soit atteinte (inutile pour les nombres alignés à gauche).

source: The width specification never causes a value to be truncated.
fr: La spécification de largeur ne provoque jamais une valeur à tronquer.

source: If the number of characters in the output value is greater than the specified width, or if width is not given, all characters of the value are printed (subject to the precision specification).
fr: Si le nombre de caractères de la valeur de sortie est supérieure à la largeur spécifiée, ou si la largeur n'est pas donnée, tous les caractères de la valeur sont affichés (sous réserve de la spécification de précision).

source: Type Specification
fr: Spécification Type

source: Variable type
fr: Type de Variable

source: Output format
fr: Format de sortie

source: Signed decimal integer.
fr: Entier décimal signé.

source: Unsigned octal integer.
fr: Entier octal non signé.

source: Unsigned decimal integer.
fr: Entier décimal non signé.

source: Unsigned hexadecimal integer, using "abcdef".
fr: Entier non signé en hexadécimal, qui utilise "abcdef".

source: Unsigned hexadecimal integer, using "ABCDEF".
fr: Entier hexadécimal non signé, qui utilise "ABCDEF".

source: Signed value having the form [ - ]d.dddd e [sign]ddd where d is a single decimal digit, dddd is one or more decimal digits, ddd is exactly three decimal digits, and sign is + or -.
fr: Valeur signée de la forme [ - ]d.dddd e [sign]ddd où d est un chiffre décimal simple, dddd est au moins un chiffre décimal, ddd est exactement trois chiffres décimaux, et sign est + ou -.

source: Identical to the e format except that E rather than e introduces the exponent.
fr: Identique au format e sauf que E plutôt que e introduit la notation exponentielle.

source: Signed value having the form [ - ]dddd.dddd, where dddd is one or more decimal digits.
fr: Valeur signé ayant la forme [ - ]dddd.dddd, où dddd est au moins un chiffre décimal.

source: The number of digits before the decimal point depends on the magnitude of the number, and the number of digits after the decimal point depends on the requested precision.
fr: Le nombre de chiffres avant le point décimal dépend de l'importance du nombre, et le nombre de chiffres après le point décimal dépend de la précision demandée.

source: Signed value printed in f or e format, whichever is more compact for the given value and precision.
fr: Valeur signée affichée dans le format f ou e, whichever is more compact for the given value and precision.

source: The e format is used only when the exponent of the value is less than -4 or greater than or equal to the precision argument.
fr: Le format e est utilisé uniquement lorsque l'exposant de la valeur est inférieur à -4 ou supérieur ou égal à l'argument de précision.

source: Trailing zeros are truncated, and the decimal point appears only if one or more digits follow it.
fr: Les zéros à droite sont tronqués, et le point décimal apparaît uniquement si un ou plusieurs chiffres suivent.

source: Identical to the g format, except that E, rather than e, introduces the exponent (where appropriate).
fr: Identique au format g format, sauf que E, plutôt que e, introduit la notation exponentielle (le cas échéant).

source: Flag Specification
fr: Spécification Flag

source: Default
fr: Défaut

source: Left align the result within the given field width.
fr: Aligne à gauche le résultat dans la largeur donnée du champ.

source: Right align.
fr: Aligne à droite.

source: Prefix the output value with a sign (+ or -) if the output value is of a signed type.
fr: Préfixe la valeur de sortie du signe (+ ou -) si elle est d'un type signé.

source: Sign appears only for negative signed values (-).
fr: Le signe ne s'affiche que pour les valeurs négatives signés (-).

source: If width is prefixed with 0, zeros are added until the minimum width is reached.
fr: Si width est précédée d'un 0, des zéros sont ajoutés jusqu'à ce que le minimim 'width' soit atteint.

source: If 0 and - appear, the 0 is ignored.
fr: Si 0 et - apparaisse, le 0 est ignoré.

source: If 0 is specified with an integer format (i, u, x, X, o, d) the 0 is ignored.
fr: Si 0 est spécifié avec un format 'integer' (i, u, x, X, o, d) alors le 0 est ignoré.

source: No padding.
fr: Pas de rembourrage.

source: Prefix the output value with a blank if the output value is signed and positive; the blank is ignored if both the blank and + flags appear.
fr: Précède la valeur de sortie avec un espace si elle est signée et positive; l'espace est ignoré si les drapeaux 'blank' et '+' sont levés.

source: No blank appears.
fr: Pas d'espace n'est rajouté.

source: When used with the o, x, or X format, the # flag prefixes any nonzero output value with 0, 0x, or 0X, respectively.
fr: Lorsqu'il est utilisé avec les formats o, x, ou X, le drapeau # préfixe une valeur de sortie non nulle avec 0, 0x ou 0X, respectivement.

source: When used with the e, E, or f format, the # flag forces the output value to contain a decimal point in all cases.
fr: Lorsqu'il est utilisé avec les formats e, E, ou f, le drapeau # force la valeur de sortie à contenir un point décimal dans tous les cas.

source: Decimal point appears only if digits follow it.
fr: Le point décimal n'apparaît que si des chiffres suivent.

source: When used with the g or G format, the # flag forces the output value to contain a decimal point in all cases and prevents the truncation of trailing zeros.
fr: Lorsqu'il est utilisé avec les formats g ou G, le drapeau # force la valeur de sortie à contenir un point décimal dans tous les cas et empêche la troncature des zéros.

source: Ignored when used with d, i, u, or s.
fr: Ignoré quand utisé avec d, i, u, or s .

source: Trailing zeros are truncated.
fr: Les zéros à droite sont tronqués.

source: Precision Specification
fr: Spécification Precision

source: The third optional field of the format specification is the precision specification.
fr: Le troisième champ optionnel de la spécification du format est la spécification de la précision.

source: It specifies a nonnegative decimal integer, preceded by a period (.), which specifies the number of characters to be printed, the number of decimal places, or the number of significant digits (see Table below).
fr: Il spécifie un entier décimal non négatif, précédé par un point (.), qui indique le nombre de caractères à afficher, le nombre de décimales, ou le nombre de chiffres significatifs (voir le tableau ci-dessous).

source: Unlike the width specification, the precision specification can cause either truncation of the output value or rounding of a floating-point value.
fr: Contrairement à la spécification de largeur, la spécification de précision peut entraîner soit la troncature de la valeur de sortie, soit l'arrondi d'une valeur à virgule flottante.

source: If precision is specified as 0 and the value to be converted is 0, the result is no characters output, as shown below:
fr: Si la précision est définie à 0 et la valeur à convertir est égale à 0, le résultat n'a aucun caractère en sortie, comme indiqué ci-dessous :

source: StringFormat( "%.0d", 0 ); /* No characters return */
fr: StringFormat("%.0d ", 0); /* Pas de caractères en retour */

source: How Precision Values Affect Type
fr: Comment la Précision affecte le Type

source: The precision specifies the minimum number of digits to be printed.
fr: La précision indique le nombre minimum de chiffres à afficher.

source: If the number of digits in the argument is less than precision, the output value is padded on the left with zeros.
fr: Si le nombre de chiffres dans l'argument est inférieur à la précision, la valeur de sortie est complétée à gauche par des zéros.

source: The value is not truncated when the number of digits exceeds precision.
fr: La valeur n'est pas tronquée lorsque le nombre de chiffres dépasse précision.

source: Default precision is 1.
fr: La précision par défaut est 1.

source: The precision specifies the number of digits to be printed after the decimal point.
fr: La précision spécifie le nombre de chiffres à afficher après le point décimal.

source: The last printed digit is rounded.
fr: Le dernier chiffre affiché est arrondie.

source: Default precision is 6; if precision is 0 or the period (.) appears without a number following it, no decimal point is printed.
fr: La précision par défaut est 6; si la précision est 0 ou si le point (.)apparaît non suivi d'un chiffre, le point décimal n'est pas affiché.

source: The precision value specifies the number of digits after the decimal point.
fr: La valeur de précision spécifie le nombre de chiffres après le point décimal.

source: If a decimal point appears, at least one digit appears before it.
fr: Si le point décimal est affiché, au moins un chiffre apparait devant.

source: The value is rounded to the appropriate number of digits.
fr: La valeur est arrondie au nombre de chiffres approprié.

source: Default precision is 6; if precision is 0, or if the period (.) appears without a number following it, no decimal point is printed.
fr: La précision par défaut est 6; si la précision est 0, ou si le point (.)apparaît non suivi d'un chiffre, le point décimal n'est pas affiché.

source: The precision specifies the maximum number of significant digits printed.
fr: La précision spécifie le nombre maximum de chiffres significatifs affichés.

source: Six significant digits are printed, with any trailing zeros truncated.
fr: Six chiffres significatifs sont affichés, avec les zéros tronqués.

source: The precision specifies the maximum number of characters to be printed.
fr: La précision indique le nombre maximal de caractères à afficher.

source: Characters in excess of precision are not printed.
fr: Les caractères qui excèdent la précision ne sont pas affichés.

source: Characters are printed until a null character is encountered.
fr: Les caractères sont affichés jusqu'à un caractère nul soit rencontré.

source: [string]
fr: [ chaîne ]

source: [ string]
fr: [ Chaîne ]

source: [string ]
fr: [ chaîne ]

source: [ longer s]
fr: [ Plus de ]

source: [longer s ]
fr: [ plus de ]

source: Converts an array of ASCII codes to a string.
fr: Convertit un tableau de codes ASCII en une chaîne de caractères.

source: The array of ASCII codes to convert to characters.
fr: Le tableau de codes ASCII à convertir en caractères.

source: The 0-based index to start processing from (Default:
fr: L'index de base 0 où commencer le traitement (par défaut :

source: The 0-based index to end processing at (Default:
fr: L'index de base 0 où terminer le traitement (par défaut :

source: Note that the character at this index is NOT included in the output.
fr: Notez que le caractère à cet index n'est PAS inclus dans la sortie.

source: The array contains values in the specified character set:
fr: Le tableau contient des valeurs dans un jeu de caractères spécifié:

source: 0 = UTF-16 (Default)
fr: 0 = UTF-16 (par défaut)

source: a string with character representations of the ASCII codes.
fr: Retourne une chaîne avec des caractères représentants les codes ASCII.

source: 1 = Input is not an array.
fr: 1 = l'entrée n'est pas un tableau.

source: 2 = Invalid start index.
fr: 2 = l'index de début n'est pas valide.

source: The returned string may contain embedded Chr(0) but will still be a string type.
fr: La chaîne retournée peut contenir Chr(0) mais sera encore de type chaîne.

source: Most string functions will stop at the first Chr(0) found, however, if access to the entire contents of the string is required then the StringToBinary() function can convert it into a BinaryString preserving all the data.
fr: La plupart des fonctions chaînes stopperont au premier Chr(0) rencontré, cependant, si l'accès au contenu entier de la chaîne est nécessaire alors la fonction StringToBinary() peut la convertir en un BinaryString pour préserver toutes les données.

source: If you attempt to create an array manually (As opposed to using an array returned from StringToASCIIArray()) then the codes in the array must be specified in UNICODE.
fr: Si vous essayez de créer un tableau manuellement (par opposition à l'utilisation d'un tableau retourné par StringToASCIIArray()), alors les codes du tableau doivent être spécifiés en UNICODE.

source: Required for _ArrayDisplay() only.
fr: Requis pour _ArrayDisplay() uniquement.

source: Convert the string to an ASCII array.
fr: Convertir la chaîne en un tableau ASCII.

source: Display the array to see that it contains the ASCII values for each character in the string.
fr: Affiche le tableau pour voir qu'il contient les valeurs ASCII pour chaque caractère de la chaîne.

source: Convert the array into a string.
fr: Convertit le tableau en une chaîne.

source: Display the string to see that it matches the original string initially converted to an array.
fr: Affiche la chaîne pour voir qu'elle correspond à la chaîne d'origine d'abord convertie en un tableau.

source: Checks if a string contains a given substring.
fr: Vérifie si une chaîne contient une sous-chaîne donnée.

source: The string to evaluate.
fr: La chaîne à analyser.

source: The substring to search for.
fr: La sous-chaîne à rechercher.

source: Which occurrence of the substring to find in the string.
fr: Quelle occurrence de la sous-chaîne à trouver dans la chaîne.

source: Use a negative occurrence to search from the right side.
fr: Utiliser une occurrence négative pour rechercher à partir de la droite de la chaîne.

source: The default value is 1 (finds first occurrence).
fr: La valeur par défaut est 1 (trouve la première occurrence).

source: The starting position of the search.
fr: La position de départ de la recherche.

source: The number of characters to search.
fr: Le nombre de caractères à traiter.

source: This effectively limits the search to a portion of the full string.
fr: Ceci limite la recherche à une partie de la chaîne complète .

source: the position of the substring.
fr: Retourne la position de la sous-chaîne.

source: 0 if substring not found.
fr: Retourne 0 si la sous-chaîne n'est pas trouvée.

source: 1 = Invalid "start" or "occurrence" parameter given.
fr: 1 = Paramètres 'start' ou 'occurrence' invalide.

source: The first character position is 1.
fr: La position du premier caractère est 1.

source: The count parameter must not be shorter than the substring being searched for.
fr: Le paramètre 'count' doit être plus long que la sous-chaîne recherchée .

source: The count parameter (combined with the start parameter) effectively limits the search to a substring of the full string.
fr: Le paramètre 'count' (combiné avec le paramètre 'start') limite efficacement la recherche à une sous-chaîne de la chaîne complète.

source: The following two statements are equivalent:
fr: Les instructions suivantes sont équivalentes:

source: StringInStr("the string to search", "string", 0, 1, 1, 11)
fr: StringInStr("La chaîne à chercher", "chaîne", 0, 1, 1, 11)

source: StringInStr(StringMid("the string to search", 1, 11), "string")
fr: StringInStr(StringMid("La chaîne à chercher", 1, 11), "chaîne")

source: Retrieve the character position of where the string 'white' first occurs in the sentence.
fr: Récupére la position du caractère à l'endroit où la chaîne 'white' apparaît la première fois dans la phrase.

source: Checks if a string contains only alphanumeric characters.
fr: Vérifie si une chaîne contient uniquement des caractères alphanumériques.

source: The string to check
fr: La chaîne à tester

source: 0 if string contains non-alphanumeric characters.
fr: Retourne 0 si la chaîne contient des caractères non-alphanumériques.

source: Keep in mind that any whitespace will cause StringIsAlNum() to return 0.
fr: Notez que les espaces blancs feront que StringIsAlNum() retournera 0.

source: Check whether this string contains only alphanumeric characters.
fr: Vérifie si cette chaîne ne contient que des caractères alphanumériques.

source: Checks if a string contains only alphabetic characters.
fr: Vérifie si la chaîne contient uniquement des caractères alphabétiques.

source: 0 if string contains non-alphabetic characters.
fr: Retourne 0 si la chaîne contient des caractères non-alphabétiques.

source: Keep in mind that any whitespace will cause StringIsAlpha() to return 0.
fr: Notez que les espaces blancs feront que StringIsAlpha retournera 0.

source: Check whether this string contains only alphabetic characters.
fr: Vérifie si cette chaîne ne contient que des caractères alphabétiques.

source: Checks if a string contains only ASCII characters in the range 0x00 - 0x7f (0 - 127).
fr: Vérifie si la chaîne contient uniquement des caractères ASCII compris entre 0x00 et 0x7f (0 - 127).

source: 0 if string contains extended ASCII characters.
fr: Retourne 0 si la chaîne contient des caractères ASCII étendus.

source: Check whether this string contains only ASCII characters.
fr: Vérifie si cette chaîne ne contient que des caractères ASCII.

source: Checks if a string contains only digit (0-9) characters.
fr: Vérifie si une chaîne contient uniquement des chiffres (0-9).

source: 0 if string contains non-digits.
fr: Retourne 0 si la chaîne contient des caractères autres que des chiffres.

source: See examples.
fr: Voir les exemples.

source: Returns 1, as the string contains only digit (0-9) characters.
fr: Retourne 1, car la chaîne ne contient que des chiffres (0-9).

source: Returns 0, due to the decimal point.
fr: Retourne 0, en raison du point décimal.

source: Returns 1, due to the number to string conversion.
fr: Retourne 1, en raison du nombre de conversion de chaîne.

source: Returns 0, as the + (plus) symbol is present in the string.
fr: Retourne 0, car le symbole plus (+) est présent dans la chaîne.

source: Checks if a string is a floating point number.
fr: Vérifie si une chaîne contient est un nombre à virgule flottante.

source: The string or expression to check.
fr: La chaîne ou l'expression à vérifier.

source: 0 if not floating point format.
fr: Retourne 0 si ce n'est pas le format d'un nombre à virgule flottante.

source: A string is a float if it contains at least one decimal digit and exactly one period; the only other character allowed is an optional plus or minus at the beginning.
fr: Une chaîne est un 'float' si elle contient au moins un chiffre décimal et un seul point, les seuls autres caractères permis sont un plus (+) ou un moins (-) optionnel au début.

source: (StringIsFloat() does not accept a comma character as the decimal point even if the computer Locale settings use that symbol.)
fr: (StringIsFloat() n'accepte pas le caractère virgule comme séparateur décimal, même si les paramètres régionaux de l'ordinateur utilisent ce symbole).

source: If parameter is not a string, its value is converted to a string.
fr: Si le paramètre n'est pas une chaîne, sa valeur est convertie en une chaîne.

source: Returns 1, due to the decimal point.
fr: Retourne 1, en raison de la virgule.

source: Returns 0, as the string 3 / (forward slash) 4 is not a floating point number.
fr: Retourne 0, car la chaîne 3/4 n'est pas un nombre à virgule flottante.

source: Returns 1, due to the number to string conversion as well as the decimal point.
fr: Retourne 1.

source: Returns 0, due to 2 being an integer.
fr: Retourne 0, car 2 est un nombre 'integer'.

source: Checks if a string is an integer.
fr: Vérifie si une chaîne contient un nombre entier.

source: The string to check.
fr: La chaîne à vérifier.

source: 0 if string cannot be an integer.
fr: Retourne 0 si la chaîne ne contient pas un nombre entier.

source: StringIsInt() also returns 1 for non-string integer expressions; however, StringIsInt() returns 0 for hexadecimal expressions such as "4ff0".
fr: StringIsInt() retourne aussi 1 pour un entier qui n'est pas sous la forme d'une chaîne de caractères; cependant, StringIsInt() retourne 0 pour des expressions hexadécimales telle que "4ff0".

source: The only punctuation allowed is either a plus or a minus at the beginning of the string.
fr: La seule ponctuation autorisée est le signe plus ou moins en début de chaîne.

source: Returns 1, due to the + (plus) symbol being at the beginning of the string.
fr: Retourne 1, car le symbole + est, au début de la chaîne.

source: Returns 1, due to the - (minus) symbol being at the beginning of the string.
fr: Retourne 1, car - est au début de la chaîne.

source: Returns 0, as the + (plus) symbol is not at the beginning of the string.
fr: Retourne 0, car le symbole plus (+) n'est pas au début de la chaîne.

source: Checks if a string contains only lowercase characters.
fr: Vérifie si une chaîne contient uniquement des lettres minuscules.

source: 0 if string contains non-lowercase characters.
fr: Retourne 0 si la chaîne contient des caractères autres que des lettres minuscules.

source: Note that digits/punctuation/whitespace will cause StringIsLower() to return 0.
fr: Notez que les chiffres, la ponctuation et les espaces blancs feront que StringIsLower() retournera 0 comme valeur de retour.

source: Check whether this string contains only lowercase characters.
fr: Vérifie si cette chaîne ne contient que des caractères minuscules.

source: Checks if a string contains only uppercase characters.
fr: Vérifie si une chaîne contient uniquement des lettres majuscules.

source: 0 if string contains non-uppercase characters.
fr: Retourne 0 si la chaîne contient des caractères autres que des lettres majuscules.

source: Note that digits/punctuation/whitespace will cause StringIsUpper() to return 0.
fr: Notez que les chiffres, la ponctuation et les espaces blancs feront que StringIsUpper() retournera 0 comme valeur de retour.
